xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
    // Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    //NRF_LOG_INFO("call to ble_lbs_on_db_disc_evt for instance %d and link 0x%x!\r\n",
	NRF_LOG_INFO("call to  instance %d and link 0x%x!\r\n",
                    p_evt->conn_handle,
                    p_evt->conn_handle);
    
	
	ble_nus_c_on_db_disc_evt(&m_ble_nus_c[p_evt->conn_handle], p_evt);
}


/** @brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}



/** @brief Function to sleep until a BLE event is received by the application.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

static void ble_process_buf_handler(void * p_context)
{
  int eat_i = 0, ble_hd = 0, find_tx_data = 0;
  unsigned char uart_tx_buffer;
  uint32_t err_code;
  UNUSED_PARAMETER(p_context);
  
  NRF_LOG_INFO ("ble_process_buf_handler\r\n");
  app_timer_stop(m_ble_tx_timer_id);
  
  //while (find_tx_data < 10) {
  //  if (packet_data_cnt[find_tx_data] >= 10) {
  //    ble_hd = find_tx_data;
  //    break;
  //  }
  //  find_tx_data++;
  //};
  
//  ble_hd = packet_data_tx_order[tx_order_index_sell];
//  tx_order_index_sell++;
//  
//  if (tx_order_index_sell >= TX_ORDER_NUM)
//    tx_order_index_sell = 0;

  while (eat_i < 10) {
    err_code = app_fifo_get(&tx_fifo[ble_hd].tx_fifo_handle, &uart_tx_buffer);
    /* NRF_LOG_INFO ("eat_i %d uart_tx_buffer -> %c\r\n", eat_i, uart_tx_buffer); */
    eat_i++;
    //while (app_uart_put( p_ble_nus_evt->p_data[i]) != NRF_SUCCESS)
    while (app_uart_put(uart_tx_buffer) != NRF_SUCCESS);
  };
  app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);

}


static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/* For BLE uart RX buffer */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
    err_code = app_timer_create(&m_ble_tx_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                ble_process_buf_handler);
    APP_ERROR_CHECK(err_code);
}

int main(void)
{
    ret_code_t err_code;
    int i = 0;
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO(TEST_VERSION);
    
    timers_init();

		uart_init();
    ble_stack_init();

    db_discovery_init();
    nus_c_init();
    
    NRF_LOG_INFO("Multi Link Uart Bridge\r\n");

    for (i = 0; i < CENTRAL_LINK_COUNT; i++) {
      tx_fifo[i].tx_buf = &alloc_tx_buf[i][0];
      tx_fifo[i].tx_buf_size = BUFFER_SZ;
      NRF_LOG_INFO("tx_fifo[%d].tx_buf_size %d\r\n", i, tx_fifo[i].tx_buf_size);
      err_code = app_fifo_init(&tx_fifo[i].tx_fifo_handle, tx_fifo[i].tx_buf, tx_fifo[i].tx_buf_size);
      APP_ERROR_CHECK(err_code);
    }

    // Start scanning for peripherals and initiate connection to devices which
    // advertise.
    scan_start();
    application_timers_start();

    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            // Wait for BLE events.
            power_manage();
        }
    }
}
